{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv1", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "block1_conv1", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "filters": 64, "activation": "relu", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv2", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "block1_conv2", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "filters": 64, "activation": "relu", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block1_pool", "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "block1_pool", "pool_size": [2, 2], "trainable": true}}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv1", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "block2_conv1", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "filters": 128, "activation": "relu", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv2", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "block2_conv2", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "filters": 128, "activation": "relu", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block2_pool", "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "block2_pool", "pool_size": [2, 2], "trainable": true}}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv1", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "block3_conv1", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "filters": 256, "activation": "relu", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv2", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "block3_conv2", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "filters": 256, "activation": "relu", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv3", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "block3_conv3", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "filters": 256, "activation": "relu", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block3_pool", "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "block3_pool", "pool_size": [2, 2], "trainable": true}}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv1", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "block4_conv1", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "filters": 512, "activation": "relu", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv2", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "block4_conv2", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "filters": 512, "activation": "relu", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv3", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "block4_conv3", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "filters": 512, "activation": "relu", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block4_pool", "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "block4_pool", "pool_size": [2, 2], "trainable": true}}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv1", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "block5_conv1", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "filters": 512, "activation": "relu", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv2", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "block5_conv2", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "filters": 512, "activation": "relu", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv3", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "block5_conv3", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "filters": 512, "activation": "relu", "padding": "same", "data_format": "channels_last", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block5_pool", "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "block5_pool", "pool_size": [2, 2], "trainable": true}}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten", "config": {"name": "flatten", "trainable": true}}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "class_name": "Dense", "name": "fc1", "config": {"units": 4096, "name": "fc1", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["fc1", 0, 0, {}]]], "class_name": "Dense", "name": "fc2", "config": {"units": 4096, "name": "fc2", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["fc2", 0, 0, {}]]], "class_name": "Dense", "name": "predictions", "config": {"units": 1000, "name": "predictions", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activation": "softmax", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null}}], "input_layers": [["input_1", 0, 0]], "name": "vgg16", "output_layers": [["predictions", 0, 0]]}, "keras_version": "2.0.8"}